Pandas:- Pandas is a python library developed on the top of numpy. Pandas library contain two types of data structures first Series and second DataFrame.  Pandas is a data analysis library, which is deals with .csv (comma separated value) files.

Series():- Series is a class in pandas. The object of Series class stores a one dimensional array with one column.
DataFrame():- DataFrame is a class in pandas. The object of DataFrame class stores two dimensional array.

In [1]:
import numpy as np
import pandas as pd

In [2]:
# create a series using pandas Series()
ser1= pd.Series([1,2,3,4,5])
ser1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
ser2=pd.Series(np.arange(1,11,2).astype(np.int32))
ser2

0    1
1    3
2    5
3    7
4    9
dtype: int32

In [13]:
#wpp to create a Dataframe
emp={
    "empid":[1001,1002,1003,1004],
    "empname":["Rohit","Mohit","Shobhit","Mudit"],
    "salary":[50000,45000,60000,55000]
}
df=pd.DataFrame(emp)
print(df)

   empid  empname  salary
0   1001    Rohit   50000
1   1002    Mohit   45000
2   1003  Shobhit   60000
3   1004    Mudit   55000

In [14]:
df

   empid  empname  salary
0   1001    Rohit   50000
1   1002    Mohit   45000
2   1003  Shobhit   60000
3   1004    Mudit   55000

In [5]:
# shape is a property of DataFrame which display no of rows and columns
df.shape

(4, 3)

In [6]:
#info() is a func of DataFrame which is used to display info about DatFrame 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   empid    4 non-null      int64
 1   empname  4 non-null      object
 2   salary   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [7]:
df.describe()

             empid        salary
count     4.000000      4.000000
mean   1002.500000  52500.000000
std       1.290994   6454.972244
min    1001.000000  45000.000000
25%    1001.750000  48750.000000
50%    1002.500000  52500.000000
75%    1003.250000  56250.000000
max    1004.000000  60000.000000

In [8]:
df

   empid  empname  salary
0   1001    Rohit   50000
1   1002    Mohit   45000
2   1003  Shobhit   60000
3   1004    Mudit   55000

In [9]:
#head() :- head() function of Dataframe display top rows.By default this function display top 5 rows
df.head(2)

   empid empname  salary
0   1001   Rohit   50000
1   1002   Mohit   45000

In [10]:
#tail() :- tail() function of Dataframe display bottom rows.By default this function display bottom 5 rows
df.tail(2)

   empid  empname  salary
2   1003  Shobhit   60000
3   1004    Mudit   55000

In [11]:
# .csv (comma separated value)
# to_csv() func is used to write DataFrame data into .csv file
df.to_csv("emp.csv",index=None)
print("Information is saved")

Information is saved

In [ ]:
#read_csv :- is used to read csv file and return a data frame.
df2=pd.read_csv('emp.csv')
df2

   empid  empname  salary
0   1001    Rohit   50000
1   1002    Mohit   45000
2   1003  Shobhit   60000
3   1004    Mudit   55000